tap "cantino/mcfly"
tap "danielfoehrkn/switch"
tap "fairwindsops/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "mas-cli/tap"
tap "warrensbox/tap"
brew "ansible"
brew "asciinema"
brew "awscli"
brew "aztfexport"
brew "azure-cli"
brew "eza"
brew "fzf"
brew "git"
brew "go-task"
brew "netpbm"
brew "helm"
brew "helmfile"
brew "httpie"
brew "jq"
brew "k9s"
brew "krew"
brew "kube-ps1"
brew "kubecm"
brew "kubeconform"
brew "kubectx"
brew "kubent"
brew "librsvg"
brew "mcfly"
brew "ncurses"
brew "neovim"
brew "opentofu"
brew "packer"
brew "pyenv"
brew "pyenv-virtualenv"
brew "terraform-docs"
brew "tfk8s"
brew "tldr"
brew "tree"
brew "watch"
brew "wget"
brew "yadm"
brew "yamllint"
brew "fairwindsops/tap/nova"
brew "fairwindsops/tap/pluto"
brew "hashicorp/tap/terraform-ls"
brew "mas-cli/tap/mas"
brew "warrensbox/tap/tfswitch"
brew "danielfoehrkn/switch/switch"
cask "1password"
cask "browserosaurus"
cask "dropbox"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "imageoptim"
cask "iterm2"
cask "monitorcontrol"
cask "notion"
cask "onyx"
cask "pgadmin4"
cask "pocket-casts"
cask "rancher"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "tunnelbear"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Azure VPN Client", id: 1553936137
mas "CopyClip", id: 595191960
mas "iBar", id: 6443843900
mas "MeetingBar", id: 1532419400
mas "MenubarClock", id: 492167985
mas "Microsoft Remote Desktop", id: 1295203466
mas "Telegram", id: 747648890
mas "Unsplash Wallpapers", id: 1284863847
vscode "1nVitr0.blocksort"
vscode "DavidAnson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.github-vscode-theme"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "linhmtran168.mac-ca-vscode"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "plibither8.remove-comments"
vscode "redhat.vscode-yaml"
vscode "thamaraiselvam.remove-blank-lines"
vscode "Tim-Koehler.helm-intellisense"
vscode "timkmecl.chatgpt"
vscode "Tyriar.sort-lines"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
