tap "cantino/mcfly"
tap "danielfoehrkn/switch"
tap "fairwindsops/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "mas-cli/tap"
tap "warrensbox/tap"
brew "ansible"
brew "asciinema"
brew "awscli"
brew "azure-cli"
brew "eksctl"
brew "exa"
brew "fzf"
brew "git"
brew "helm"
brew "helmfile"
brew "httpie"
brew "jq"
brew "k9s"
brew "krew"
brew "kubecm"
brew "kubeconform"
brew "kubectx"
brew "mcfly"
brew "ncurses"
brew "neovim"
brew "packer"
brew "terraform-docs"
brew "tfk8s"
brew "tldr"
brew "tree"
brew "watch"
brew "wget"
brew "yadm"
brew "danielfoehrkn/switch/switch"
brew "fairwindsops/tap/nova"
brew "hashicorp/tap/terraform-ls"
brew "mas-cli/tap/mas"
brew "warrensbox/tap/tfswitch"
cask "browserosaurus"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "monitorcontrol"
cask "pocket-casts"
cask "rancher"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "iBar", id: 6443843900
mas "iScreen Shoter", id: 1596559494
mas "MeetingBar", id: 1532419400
mas "MenubarClock", id: 492167985
mas "Microsoft Remote Desktop", id: 1295203466
mas "Unsplash Wallpapers", id: 1284863847
vscode "1nVitr0.blocksort"
vscode "bbenoist.vagrant"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "henriiik.vscode-sort"
vscode "linhmtran168.mac-ca-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-pt-BR"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "tal7aouy.theme"
vscode "Tim-Koehler.helm-intellisense"
vscode "Tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
